SET @start_value= @@global.log_throttle_ddl;
SET @@global.log_throttle_ddl= DEFAULT;
SELECT @@global.log_throttle_ddl;
@@global.log_throttle_ddl
0
SET @@global.log_throttle_ddl= 1000;
SELECT @@global.log_throttle_ddl;
@@global.log_throttle_ddl
1000
SET @@global.log_throttle_ddl= -1;
Warnings:
Warning	1292	Truncated incorrect log_throttle_ddl value: '-1'
SELECT @@global.log_throttle_ddl;
@@global.log_throttle_ddl
0
SET @@global.log_throttle_ddl= 5;
SELECT @@global.log_throttle_ddl;
@@global.log_throttle_ddl
5
SET @@global.log_throttle_ddl= OFF;
ERROR 42000: Incorrect argument type to variable 'log_throttle_ddl'
SELECT @@global.log_throttle_ddl;
@@global.log_throttle_ddl
5
SET @@global.log_throttle_ddl= ON;
ERROR 42000: Incorrect argument type to variable 'log_throttle_ddl'
SELECT @@global.log_throttle_ddl;
@@global.log_throttle_ddl
5
SET GLOBAL log_throttle_ddl= 0.01;
ERROR 42000: Incorrect argument type to variable 'log_throttle_ddl'
SET SESSION log_throttle_ddl= 0;
ERROR HY000: Variable 'log_throttle_ddl' is a GLOBAL variable and should be set with SET GLOBAL
SET LOCAL log_throttle_ddl= 0;
ERROR HY000: Variable 'log_throttle_ddl' is a GLOBAL variable and should be set with SET GLOBAL
SET @@global.log_throttle_ddl= @start_value;
